Revit 2026 API

# ArgumentNullException Class

---

The exception that is thrown when  is passed to a method that does not accept it as a valid argument.

SystemObject SystemException Autodesk.Revit.ExceptionsApplicationException Autodesk.Revit.ExceptionsArgumentException Autodesk.Revit.ExceptionsArgumentNullException

**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[SerializableAttribute]
public class ArgumentNullException : ArgumentException
```
```vb
<SerializableAttribute>
Public Class ArgumentNullException
	Inherits ArgumentException
```
```cpp
[SerializableAttribute]
public ref class ArgumentNullException : public ArgumentException
```
```fsharp
[<SerializableAttribute>]
type ArgumentNullException =
    class
        inherit ArgumentException
    end
```

The ArgumentNullException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.(Inherited from Exception) |
|  | FunctionId | The information of the function throwing the exception.(Inherited from ApplicationException) |
|  | HelpLink | Gets or sets a link to the help file associated with this exception.(Inherited from Exception) |
|  | HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.(Inherited from Exception) |
|  | InnerException | Gets the Exception instance that caused the current exception.(Inherited from Exception) |
|  | Message | Gets the error message and the parameter name, or only the error message if no parameter name is set.(Inherited from ArgumentException) |
|  | ParamName | Gets the name of the parameter that causes this exception.(Inherited from ArgumentException) |
|  | Source | Gets or sets the name of the application or the object that causes the error.(Inherited from Exception) |
|  | StackTrace | Gets a string representation of the immediate frames on the call stack.(Inherited from Exception) |
|  | TargetSite | Gets the method that throws the current exception.(Inherited from Exception) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.(Inherited from Exception) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |
|  | GetType | Gets the runtime type of the current instance.(Inherited from Exception) |
|  | ToString | Creates and returns a string representation of the current exception.(Inherited from Exception) |

#### Reference

Autodesk.Revit.Exceptions Namespace